c6620_histogram_not_consolidated/multiplier_5_delay_2/run5.txt
# run=5/10
# 2026-04-01T02:19:28-06:00
# cmd: taskset -c 1-55 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
       1.367 |                                         1
       1.417 |                                         1
       1.443 |                                         1
       1.496 |                                         3
       1.523 |                                         3
       1.551 |                                         3
       1.579 |                                         5
       1.608 |                                         6
       1.637 |                                         12
       1.667 |                                         12
       1.697 |                                         14
       1.728 |*                                        24
       1.759 |*                                        30
       1.791 |*                                        30
       1.824 |*                                        28
       1.857 |*                                        29
       1.891 |*                                        41
       1.925 |*                                        26
       1.960 |*                                        40
       1.996 |*                                        43
       2.032 |*                                        36
       2.069 |*                                        28
       2.106 |**                                       69
       2.145 |**                                       59
       2.184 |*                                        53
       2.223 |**                                       55
       2.264 |**                                       55
       2.305 |**                                       73
       2.347 |*                                        51
       2.389 |**                                       66
       2.433 |**                                       55
       2.477 |*                                        43
       2.522 |*                                        47
       2.568 |**                                       56
       2.615 |**                                       62
       2.662 |**                                       55
       2.710 |**                                       58
       2.760 |*                                        54
       2.810 |**                                       58
       2.861 |**                                       64
       2.913 |**                                       60
       2.966 |**                                       59
       3.020 |**                                       64
       3.075 |**                                       62
       3.130 |**                                       55
       3.187 |*                                        49
       3.245 |*                                        53
       3.304 |**                                       58
       3.364 |**                                       65
       3.425 |**                                       62
       3.488 |**                                       60
       3.551 |**                                       57
       3.615 |*                                        49
       3.681 |**                                       70
       3.748 |**                                       70
       3.816 |**                                       67
       3.885 |**                                       71
       3.956 |**                                       77
       4.028 |**                                       62
       4.101 |**                                       67
       4.176 |**                                       69
       4.252 |**                                       61
       4.329 |**                                       57
       4.407 |**                                       60
       4.487 |**                                       78
       4.569 |**                                       73
       4.652 |**                                       72
       4.737 |*                                        54
       4.823 |**                                       70
       4.910 |**                                       84
       4.999 |**                                       78
       5.090 |**                                       83
       5.183 |**                                       69
       5.277 |**                                       74
       5.373 |**                                       80
       5.470 |**                                       59
       5.570 |**                                       88
       5.671 |**                                       59
       5.774 |**                                       78
       5.879 |**                                       74
       5.986 |**                                       88
       6.095 |**                                       79
       6.205 |**                                       68
       6.318 |**                                       85
       6.433 |**                                       79
       6.550 |***                                      99
       6.669 |**                                       82
       6.790 |**                                       81
       6.913 |**                                       66
       7.039 |**                                       81
       7.167 |***                                      92
       7.297 |***                                      96
       7.430 |***                                      96
       7.565 |***                                      106
       7.702 |**                                       81
       7.842 |**                                       77
       7.985 |**                                       70
       8.130 |**                                       90
       8.277 |**                                       75
       8.428 |**                                       87
       8.581 |***                                      97
       8.737 |**                                       75
       8.895 |**                                       90
       9.057 |**                                       87
       9.222 |**                                       91
       9.389 |**                                       81
       9.560 |**                                       76
       9.734 |**                                       76
       9.910 |**                                       72
      10.090 |**                                       71
      10.274 |**                                       83
      10.460 |**                                       76
      10.651 |**                                       77
      10.844 |**                                       91
      11.041 |**                                       89
      11.242 |**                                       77
      11.446 |**                                       82
      11.654 |**                                       88
      11.866 |**                                       75
      12.081 |**                                       69
      12.301 |**                                       70
      12.524 |**                                       71
      12.752 |**                                       78
      12.984 |**                                       70
      13.219 |**                                       70
      13.460 |**                                       66
      13.704 |**                                       76
      13.953 |**                                       75
      14.207 |**                                       82
      14.465 |**                                       69
      14.728 |**                                       80
      14.995 |**                                       72
      15.268 |**                                       80
      15.545 |**                                       56
      15.828 |**                                       79
      16.115 |**                                       70
      16.408 |**                                       73
      16.706 |**                                       61
      17.010 |**                                       75
      17.319 |**                                       88
      17.633 |**                                       74
      17.954 |**                                       71
      18.280 |**                                       80
      18.612 |**                                       80
      18.950 |**                                       68
      19.295 |**                                       83
      19.645 |**                                       82
      20.002 |**                                       65
      20.366 |**                                       84
      20.736 |**                                       55
      21.112 |**                                       81
      21.496 |**                                       78
      21.886 |**                                       75
      22.284 |**                                       70
      22.689 |**                                       78
      23.101 |**                                       69
      23.521 |**                                       84
      23.948 |**                                       72
      24.384 |**                                       73
      24.827 |**                                       74
      25.278 |**                                       75
      25.737 |**                                       81
      26.205 |**                                       76
      26.681 |**                                       85
      27.165 |**                                       76
      27.659 |**                                       73
      28.162 |**                                       66
      28.673 |**                                       69
      29.194 |**                                       77
      29.725 |***                                      93
      30.265 |**                                       78
      30.815 |***                                      111
      31.375 |***                                      113
      31.945 |****                                     138
      32.525 |****                                     144
      33.116 |*****                                    194
      33.718 |******                                   230
      34.330 |********                                 284
      34.954 |*********                                345
      35.589 |**********                               365
      36.236 |*************                            459
      36.894 |***************                          564
      37.565 |*****************                        623
      38.247 |*********************                    753
      38.942 |**********************                   815
      39.650 |***********************                  827
      40.370 |****************************             1031
      41.104 |******************************           1080
      41.851 |********************************         1184
      42.611 |**********************************       1250
      43.385 |*************************************    1338
      44.173 |**************************************   1399
      44.976 |***************************************  1439
      45.793 |*************************************    1361
      46.625 |**************************************   1370
      47.472 |**************************************** 1459
      48.335 |***************************************  1419
      49.213 |***********************************      1288
      50.107 |*********************************        1219
      51.018 |********************************         1152
      51.945 |******************************           1105
      52.889 |***************************              976
      53.850 |*************************                901
      54.828 |*********************                    768
      55.824 |******************                       649
      56.839 |***************                          549
      57.871 |************                             455
      58.923 |***********                              406
      59.993 |********                                 302
      61.083 |*******                                  255
      62.193 |*****                                    200
      63.323 |*****                                    187
      64.474 |****                                     145
      65.645 |**                                       91
      66.838 |***                                      100
      68.053 |**                                       84
      69.289 |**                                       86
      70.548 |**                                       89
      71.830 |**                                       81
      73.135 |**                                       61
      74.464 |**                                       79
      75.817 |**                                       90
      77.194 |**                                       89
      78.597 |**                                       79
      80.025 |***                                      106
      81.479 |****                                     157
      82.959 |****                                     163
      84.467 |*****                                    169
      86.002 |****                                     152
      87.564 |****                                     163
      89.155 |*****                                    178
      90.775 |*****                                    196
      92.424 |******                                   210
      94.104 |******                                   207
      95.814 |*****                                    186
      97.555 |****                                     160
      99.327 |*****                                    168
     101.132 |***                                      116
     102.969 |***                                      99
     104.840 |**                                       79
     106.745 |**                                       65
     108.685 |**                                       61
     110.659 |*                                        47
     112.670 |*                                        27
     114.717 |*                                        39
     116.802 |*                                        25
     118.924 |                                         12
     121.085 |                                         13
     123.285 |                                         16
     125.525 |*                                        22
     127.805 |*                                        24
     130.128 |                                         18
     132.492 |*                                        28
     134.899 |*                                        19
     137.350 |*                                        22
     139.846 |*                                        29
     142.387 |*                                        23
     144.974 |                                         17
     147.608 |                                         9
     150.290 |                                         18
     153.021 |                                         9
     155.801 |                                         10
     158.632 |                                         11
     161.514 |                                         7
     164.449 |                                         6
     167.437 |                                         4
     170.479 |                                         2
     173.577 |                                         2
     176.731 |                                         2
     179.942 |                                         5
     183.211 |                                         3
     186.540 |                                         6
     189.929 |                                         2
     193.380 |                                         2
     196.894 |                                         2
     200.472 |                                         1
     204.114 |                                         3
     219.358 |                                         1
     223.344 |                                         2
     231.534 |                                         1
     248.825 |                                         1
     262.636 |                                         1
 
SQL statistics:
    queries performed:
        read:                            742980
        write:                           193190
        other:                           99190
        total:                           1035360
    transactions:                        46120  (768.34 per sec.)
    queries:                             1035360 (17248.57 per sec.)
    ignored errors:                      6950   (115.78 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      768.3359
    time elapsed:                        60.0258s
    total number of events:              46120

Latency (ms):
         min:                                    1.37
         avg:                                   41.64
         max:                                  261.61
         95th percentile:                       87.56
         sum:                              1920269.04

Threads fairness:
    events (avg/stddev):           1441.2500/22.19
    execution time (avg/stddev):   60.0084/0.01